print("Программа для сложения двух чисел")
x = int(input("Введите первое число " ))
y = int(input("Введите второе число " ))
z=x+y
print("\nСумма:", z )

input('\nНажать Enter, чтобы перейти к операции "Разность".')

print("Программа для разности двух чисел")
x = int(input("Введите первое число " ))
y = int(input("Введите второе число " ))
z=x-y
print("\nРазность:", z )

input('\nНажать Enter, чтобы перейти у операции "Умножение".')

print("Программа для умножения двух чисел")
x = int(input("Введите первое число " ))
y = int(input("Введите второе число " ))
z=x*y
print("\nУмножение:", z)

input('\nНажать Enter, чтобы перейти к операции "Деление".')

print("Программа для деления двух чисел")
x = float(input("Введите первое число " ))
y = float(input("Введите второе число " ))
z=x/y
print("\nДеление:", z)

input("\nНажать Enter, чтобы выйти.")
